// 서울시 소방서 및 하위기관 데이터

const FIRE_STATIONS = {
  "119특수구조단": ["특수구조대", "수난구조대", "산악구조대", "119항공대"],
  "종로소방서": ["현장대응단", "신교119안전센터", "종로119안전센터", "연건119안전센터", "신영119안전센터", "숭인119안전센터"],
  "중부소방서": ["현장대응단","을지로119안전센터", "충무로119안전센터", "회현119안전센터","신당119안전센터"],
  "광진소방서": ["현장대응단", "능동119안전센터", "중곡119안전센터"],
  "용산소방서": ["현장대응단", "이태원119안전센터", "후암119안전센터", "이촌119안전센터", "서빙고119안전센터"],
  "동대문소방서": ["현장대응단", "청량리119안전센터", "전농119안전센터", "용두119안전센터", "휘경119안전센터"],
  "영등포소방서": ["현장대응단", "여의도119안전센터", "당산119안전센터", "대림119안전센터", "신길119안전센터"],
  "성북소방서": ["현장대응단", "돈암119안전센터", "갈음119안전센터", "장위119안전센터"],
  "은평소방서": ["현장대응단", "녹번119안전센터", "역촌119안전센터", "수색119안전센터"],
  "강남소방서": ["현장대응단", "영동119안전센터", "역삼119안전센터", "수서119안전센터", "개포119안전센터", "세곡119안전센터"],
  "서초소방서": ["현장대응단", "방배119안전센터", "양재119안전센터", "서초119안전센터", "잠원119안전센터", "우면119안전센터"],
  "강서소방서": ["현장대응단", "화곡119안전센터", "발산119안전센터", "방화119안전센터", "개화119안전센터", "마곡119안전센터"],
  "강동소방서": ["현장대응단", "천호119안전센터", "고덕119안전센터", "암사119안전센터", "길동119안전센터", "강일119안전센터"],
  "마포소방서": ["현장대응단", "염리119안전센터", "서교119안전센터", "성산119안전센터", "공덕119안전센터", "상암119안전센터"],
  "도봉소방서": ["현장대응단", "도봉119안전센터", "창동119안전센터", "쌍문119안전센터"],
  "구로소방서": ["현장대응단", "수궁119안전센터", "고척119안전센터", "구로119안전센터", "신도림119안전센터", "공단119안전센터"],
  "노원소방서": ["현장대응단", "상계119안전센터", "공릉119안전센터", "월계119안전센터", "수락119안전센터"],
  "관악소방서": ["현장대응단", "봉천119안전센터", "신림119안전센터", "난곡119안전센터"],
  "송파소방서": ["현장대응단", "거여119안전센터", "방이119안전센터", "잠실119안전센터", "종합운동장119안전센터", "가락119안전센터"],
  "양천소방서": ["현장대응단", "신정119안전센터", "목동119안전센터", "신월119안전센터", "신트리119안전센터"],
  "중랑소방서": ["현장대응단", "면목119안전센터", "망우119안전센터", "중화119안전센터"],
  "동작소방서": ["현장대응단", "노량진119안전센터", "상도119안전센터", "백운119안전센터"],
  "서대문소방서": ["현장대응단", "북가좌119안전센터", "홍은119안전센터", "북아현119안전센터"],
  "강북소방서": ["현장대응단", "우이119안전센터", "미아119안전센터", "삼각산119안전센터"],
  "성동소방서": ["현장대응단", "성수119안전센터", "왕십리119안전센터", "금호119안전센터"],
  "금천소방서": ["현장대응단", "시흥119안전센터", "금천119안전센터"],
  "대통령경호처": ["대통령경호처"]
};

// 소방서 목록 (정렬됨)
const STATION_NAMES = Object.keys(FIRE_STATIONS).sort();
